BDD/Notas/examen-plsql.html
<!DOCTYPE html>
<html lang="es">
<head>
<!-- 2022-05-20 Fri 08:57 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PLSQL - Ejercicios pre-examen</title>
<meta name="author" content="Alberto Robles Gomez" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../css/index.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">PLSQL - Ejercicios pre-examen</h1>
</header><ol class="org-ol">
<li><p>
Realiza el procedimiento ESEANIO con un parámetro de entrada AÑO; Y
nos visualice los distintos nombres de los socios que han alquilado
ese año. (El posibles valor de C<sub>SOCIO</sub> y C<sub>PELI</sub> son correlativos).
</p>

<ul class="org-ul">
<li>Tabla PELICULAS (C<sub>PELI</sub>, TITULO, FORMATO, C<sub>PAIS</sub>, ANNO, PRECIO).</li>
<li>Tabla ALQUILER  (C<sub>SOCIO</sub>, C<sub>PELI</sub>, FECHA, NDIAS, DEVUELTA, TOTAL).</li>
<li>Tabla SOCIOS    (C<sub>SOCIO</sub>, NOMBRE, DIRECCION, CIUDAD).</li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">CREATE</span> <span class="org-keyword">OR</span> REPLACE <span class="org-keyword">PROCEDURE</span> <span class="org-function-name">ESEANIO</span> (
  anio <span class="org-keyword">IN</span> <span class="org-keyword">NUMBER</span>
) <span class="org-keyword">AS</span>
  nombre VARCHAR2(20);

  <span class="org-keyword">CURSOR</span> curNombres <span class="org-keyword">IS</span>
  <span class="org-keyword">SELECT</span> nombre
  <span class="org-keyword">FROM</span>   socios
  <span class="org-keyword">WHERE</span>  c_socio <span class="org-keyword">IN</span> (
    <span class="org-keyword">SELECT</span> c_socio
    <span class="org-keyword">FROM</span>   alquiler
    <span class="org-keyword">WHERE</span>  SUBSTR(fecha, 7, 2) = anio
  );
<span class="org-keyword">BEGIN</span>
  <span class="org-keyword">OPEN</span> curNombres;
  <span class="org-keyword">FETCH</span> curNombres <span class="org-keyword">INTO</span> nombre;

  WHILE curNombres%<span class="org-keyword">FOUND</span> LOOP
    dbms_output.put_line(nombre);

    <span class="org-keyword">FETCH</span> curNombres <span class="org-keyword">INTO</span> nombre;
  <span class="org-keyword">END</span> LOOP;

  <span class="org-keyword">CLOSE</span> curNombres;
<span class="org-keyword">END</span> ESEANIO;
</pre>
</div></li>

<li><p>
Realiza un script que visualice 50 múltiplos de 7, mayores de 100.
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SET</span> serveroutput <span class="org-keyword">ON</span>;

<span class="org-keyword">DECLARE</span>
  numero <span class="org-keyword">NUMBER</span> := 100;
<span class="org-keyword">BEGIN</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Encuentro el primer multiplo de 7 mayor a 100</span>
  WHILE <span class="org-builtin">MOD</span>(numero, 7) != 0 LOOP
    numero := numero + 1;
  <span class="org-keyword">END</span> LOOP;

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Iterar 50 veces</span>
  <span class="org-keyword">FOR</span> i <span class="org-keyword">IN</span> 1 .. 50 LOOP
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Mostrar el numero</span>
    dbms_output.put_line(numero);

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Siguiente multiplo de 7</span>
    numero := numero + 7;
  <span class="org-keyword">END</span> LOOP;
<span class="org-keyword">END</span>;
</pre>
</div></li>

<li><p>
Realiza la función CORRIGE sin parámetros que ponga bien el campo
importe de las ventas. (Teniendo en cuenta el precio y la cantidad)
La función devuelve el número de ventas que ha arreglado.
</p>

<ul class="org-ul">
<li>Tabla ARTICULO (C<sub>ART</sub>, DESCRIP, PRECIO, STOCK, C<sub>PROVEE</sub>).</li>
<li>Tabla VENTAS   (C<sub>CLI</sub>, C<sub>ART</sub>, FECHA, CANTIDAD, IMPORTE).</li>
<li>Tabla CLIENTE  (C<sub>CLI</sub>, NOMBRE, CIUDAD, TELEFONO)</li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">CREATE</span> <span class="org-keyword">OR</span> REPLACE <span class="org-keyword">FUNCTION</span> <span class="org-function-name">corrige</span>
<span class="org-keyword">RETURN</span> <span class="org-keyword">NUMBER</span> <span class="org-keyword">AS</span>
  contador <span class="org-keyword">NUMBER</span>;
<span class="org-keyword">BEGIN</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Numero de ventas q tienen mal el importe</span>
  <span class="org-keyword">SELECT</span> <span class="org-builtin">COUNT</span>(*)
  <span class="org-keyword">INTO</span>   contador
  <span class="org-keyword">FROM</span>   ventas v
  <span class="org-keyword">WHERE</span>  importe != cantidad * (
    <span class="org-keyword">SELECT</span> precio
    <span class="org-keyword">FROM</span>   articulo
    <span class="org-keyword">WHERE</span>  c_art = v.c_art
  );

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Poner bien las ventas</span>
  <span class="org-keyword">UPDATE</span> ventas v
  <span class="org-keyword">SET</span>    importe = cantidad * (
    <span class="org-keyword">SELECT</span> precio
    <span class="org-keyword">FROM</span>   articulo
    <span class="org-keyword">WHERE</span>  c_art = v.c_art
  );

  <span class="org-keyword">return</span> contador;
<span class="org-keyword">END</span> corrige;
</pre>
</div></li>

<li><p>
Realiza un procedimiento CUANTOS que tiene 2 parámetros de entrada
y visualice cuantos artículos tienen un precio entre esos dos
valores inclusive. (el primer parámetro no tiene porqué ser menor)
</p>

<ul class="org-ul">
<li>Tabla ARTICULO (C<sub>ART</sub>, DESCRIP, STOCK, PRECIO).</li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">or</span> replace
<span class="org-keyword">PROCEDURE</span> cuantos (
  desde <span class="org-keyword">IN</span> <span class="org-keyword">NUMBER</span>,
  hasta <span class="org-keyword">IN</span> <span class="org-keyword">NUMBER</span>
) <span class="org-keyword">AS</span>
  contador <span class="org-keyword">NUMBER</span>;
<span class="org-keyword">BEGIN</span>
  <span class="org-keyword">SELECT</span> <span class="org-builtin">COUNT</span>(*)
  <span class="org-keyword">INTO</span>   contador
  <span class="org-keyword">FROM</span>   articulo
  <span class="org-keyword">WHERE</span>  (precio &gt;= desde <span class="org-keyword">AND</span> precio &lt;= hasta)
     <span class="org-keyword">OR</span>  (precio &gt;= hasta <span class="org-keyword">AND</span> precio &lt;= desde);

  dbms_output.put_line(<span class="org-string">'Cuantos: '</span> || contador);
<span class="org-keyword">END</span> cuantos;
</pre>
</div></li>
</ol>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Alberto Robles Gomez</p>
<p class="date">Created: 2022-05-20 Fri 08:57</p>
</div>
</body>
</html>
